luctronics-ET/__aguada__/.old_firmware/node_sensor_11/sdkconfig.defaults
# Configurações padrão para ESP32-C3
CONFIG_IDF_TARGET="esp32c3"
CONFIG_IDF_TARGET_ESP32C3=y

# Logs
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL_DEBUG=y

# WiFi
CONFIG_ESP_WIFI_MODE_STA=y

# ESP-NOW
CONFIG_ESPNOW_ENABLE=y

# Otimizações
CONFIG_COMPILER_OPTIMIZATION_SIZE=y
CONFIG_BOOTLOADER_LOG_LEVEL_WARN=y
